configuration/src/InformationRegisters/ReportsSnapshots/ReportsSnapshots.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ReportsSnapshots</name>
  <resources>
    <name>ReportResult</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>UpdateDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>LastViewedDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>UserSetting</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ReportUpdateError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Report</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Variant</name>
    <type>
      <types>CatalogRef.ReportsOptions</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UserSettingsHash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ReportsSnapshots/Forms/RecordForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region EventHandlersForm
 
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	RecordStructure = Undefined;
	If Not Parameters.Property("RecordStructure", RecordStructure) Then
		Common.MessageToUser(NStr(
			"en = 'You can view a report snapshot only from the list of user report snapshots.';"), , , , Cancel);
		Return;
	EndIf;

	FillPropertyValues(ThisObject, RecordStructure);

	SetPrivilegedMode(True);

	Record = InformationRegisters.ReportsSnapshots.CreateRecordManager();
	FillPropertyValues(Record, Parameters.RecordStructure);
	Record.Read();
	If Not Record.Selected() Then
		Common.MessageToUser(NStr("en = 'No record is found by the specified parameters.';"), , , , Cancel);
	ElsIf Record.ReportUpdateError Then
		Common.MessageToUser(NStr("en = 'Report snapshot is not generated.';"), , , , Cancel);
	EndIf;
	If Cancel Then
		Return;
	EndIf;

	ReportResult = Record.ReportResult.Get();
	If TypeOf(ReportResult) = Type("SpreadsheetDocument") Then
		TabDocument.Put(ReportResult);
	Else
		Common.MessageToUser(NStr(
			"en = 'An error occurred when reading the report snapshot: the data is incorrect.';"), , , , Cancel);
	EndIf;

	If Not Cancel Then
		Record.LastViewedDate = CurrentSessionDate();
		Record.Write();
	EndIf;

	SetPrivilegedMode(False);

EndProcedure

#EndRegion
